{
  "headline": "Parker Coogan was a powerhouse on the football field, but he will be remembered for his generosity off of it",
  "date": "May 4, 2021",
  "byline": "By Mackenzie George",
  "Cover_asset": "<a href=\"https://cloudfront-us-east-1.images.arcpublishing.com/spectator/X3XE3ROLCVBCJMI4SYY74Q77XE.JPG\">https://cloudfront-us-east-1.images.arcpublishing.com/spectator/X3XE3ROLCVBCJMI4SYY74Q77XE.JPG</a>",
  "cover_caption": "Image courtesy of Columbia Athletics",
  "top": [],
  "body": [
    {
      "type": "text",
      "value": "The summer before his junior year of high school, Parker Coogan, CC ’20, attended a football camp at Rice University, 40 minutes from his hometown of Kingwood, Texas. There, Coogan met an assistant football coach from Columbia. The coach was impressed by the “explosive, powerful, quick kid” who, when complimented, asked if the coach really thought he could play at a school like Columbia."
    },
    {
      "type": "text",
      "value": "The answer was yes, and it was affirmed by Coogan’s illustrious career on the gridiron for the Light Blue. He was a two-time All-Ivy League honorable mention selection and a four-year letterman for the Lions, but Coogan would never lose his humble streak."
    },
    {
      "type": "text",
      "value": "“It wasn’t in an obnoxious way, fishing for compliments or anything. It was, ‘Wow, you think I can be good?’” offensive line coach Jon McLaughlin said. “Part of his charm was not realizing how bright he was as a student, how talented he was as an athlete, how charming he was as a person and a friend.”"
    },
    {
      "type": "text",
      "value": "Coogan died on April 27, one month before his 24th birthday. At the time, the former lineman was visiting family and friends in Texas, though he worked in New York City as a sales and trading analyst for Barclays Investment Bank."
    },
    {
      "type": "text",
      "value": "“He’s everything you want as the face of your program,” head coach Al Bagnoli said. “We are all devastated, to say the least.”"
    },
    {
      "type": "text",
      "value": "An immediate contributor for the Light Blue, Coogan saw action in two games and earned a varsity letter during his first year at Columbia. The following season, he became a starter; in his senior year, Coogan was the recipient of the Jack Armstrong Most Outstanding Lineman Award. However, it was his persona off the field that resonated with his teammates and friends: generous, kind, and physically and mentally tough."
    },
    {
      "type": "text",
      "value": "Unusually fast and strong, Coogan was what McLaughlin described as “almost like a running-back type athlete in a 290-pound body.” Coogan started 30 straight games for the Lions after earning a starting position as a sophomore. Bagnoli, who noted the team originally placed Coogan at guard before moving him to center, praised Coogan’s versatility, positive nature, and resilience."
    },
    {
      "type": "text",
      "value": "“Work did not wear him down,” McLaughlin emphasized. “He just had an endurance. If he was in a good mood at the beginning of practice, no matter how hot the practice was or how hard the practice was, he was in a good mood all the way through. Nothing could take that away from him.”"
    },
    {
      "type": "image",
      "value": {
        "width": "",
        "asset": "https://cloudfront-us-east-1.images.arcpublishing.com/spectator/J6GPFKVVDJDDTEAL2YE6LHT4YY.JPG",
        "caption": "",
        "credit": "Image courtesy of Columbia Athletics"
      }
    },
    {
      "type": "text",
      "value": "Coogan served as “an energy source” for the team, McLaughlin said, which meant that if someone was in need of a pick-me-up during a particularly challenging workout, all they needed to do was make eye contact with Coogan, and he would begin smiling and laughing, acting as a source of levity for those around him."
    },
    {
      "type": "text",
      "value": "Coogan’s smile serves as a constant in the countless photos of him snapped on the field. Jogging out for warm-ups. Strolling onto the field at MetLife Stadium, arms outstretched. On the sidelines, helmet in hand. Resting briefly on the bench. Standing proudly in the end zone, his hands on his hips. His open demeanor shines through the snapshots."
    },
    {
      "type": "text",
      "value": "“We couldn’t have asked for anything more,” Bagnoli said. “There [were] nothing but positives from our end. Wonderful young man, great leader.”"
    },
    {
      "type": "text",
      "value": "That leadership may have been a familial trait. Coogan’s family spent considerable time in the city during his time with the Lions. His father, Tim, sometimes managed to work from New York City; and his mother, Amy; sister, McKenna; and brother, Alexander, all attended football games at Baker Athletic Complex."
    },
    {
      "type": "text",
      "value": "“You never would have guessed they lived in Houston because they were around as much as somebody who was in North Jersey,” McLaughlin said."
    },
    {
      "type": "text",
      "value": "The Coogans also scooped up players whose families were unable to attend games, directing Parker to Uber everyone down to a restaurant for a celebratory dinner after the game, John Fischer, CC ’20, remembered."
    },
    {
      "type": "text",
      "value": "“They would take care of the people who were stragglers or people who didn’t have family ... [bringing] everyone together,” Fischer said. “Super genuine and generous people.”"
    },
    {
      "type": "text",
      "value": "This quality was shared by Coogan, Fischer added, who offered to take his friends out for dinner on their birthdays and stepped in whenever Fischer had computer problems. According to Fischer, Coogan had a study guide for everything, and he was happy to share."
    },
    {
      "type": "text",
      "value": "“No matter what he was in the middle of, if he could help someone out, he would do it,” running back Van Neils, CC ’20, said. “And sometimes it was smaller things, framing different concepts or sharing knowledge with people.”"
    },
    {
      "type": "text",
      "value": "Both eclectic and entrepreneurial, Coogan was never content to rest on his laurels. His friends highlighted how Coogan always strived to improve, whether on the field, in the weight room, or in the classroom."
    },
    {
      "type": "text",
      "value": "Rory Schlageter, CC ’20, who played tight end, grew close with Coogan during their first year at Columbia. The two later lived together, and their families spent time together after home games. Schlageter’s younger brother Will bonded with Coogan over their mutual interest in computers. Coogan was passionate about technology and eventually suggested that he and Will build a computer together. Soon after, the pandemic hit, but home in New Jersey, Schlageter watched as then 14-year-old Will and Coogan FaceTimed every night as they worked on their project. Coogan was back in Texas, but the calls continued for six months."
    },
    {
      "type": "text",
      "value": "“Parker had offered and was going to stay true to that offer,” Schlageter explained."
    },
    {
      "type": "text",
      "value": "Fellow offensive lineman Peter Wise, CC ’21, said that Coogan was the person to talk to when in need of advice, whether about a particularly challenging problem set, a job opportunity, or game film. “He was just good at almost everything that I ever saw him attempt,” Wise said."
    },
    {
      "type": "text",
      "value": "This ease extended to the weight room, where Coogan’s skills were unparalleled. As a lifter, he was “phenomenal,” Bagnoli said. According to McLaughlin, had Coogan chosen lifting as his sport rather than football, he could have competed at the national or even Olympic level."
    },
    {
      "type": "text",
      "value": "True to his humble nature, Coogan never fully acknowledged just how impressive his strength was. When he turned to his coaches for questions about how he was doing and whether he was measuring up, McLaughlin was quick to assure Coogan that yes, squatting 650 pounds was good."
    },
    {
      "type": "text",
      "value": "“In the weight room, he was someone who would set the example of how you were supposed to lift, how you were supposed to go about your business,” Wise explained."
    },
    {
      "type": "text",
      "value": "During a Jacked 4 Jaclyn Lift-a-Thon, a football fundraiser that aids the Friends of Jaclyn Foundation, Coogan strolled in and, without a warm-up, ripped out “25 reps, completely cold,” Neils said. “We’re all just standing there, and that’s significantly more than we would do on our best day after months of training, and he just busted it out no problem.”"
    },
    {
      "type": "text",
      "value": "Neils and Coogan coordinated the Jacked 4 Jaclyn fundraiser together. Its affiliated nonprofit, the Friends of Jaclyn Foundation, seeks to improve the quality of life of children with brain tumors and other pediatric cancers. Coogan was a natural choice to help lead the fundraiser. Bagnoli agreed, citing Coogan’s “tremendous amount of charisma.”"
    },
    {
      "type": "text",
      "value": "“He’s one of those guys that people just naturally gravitate to and rally around,” Bagnoli said. “He’s very, very comfortable in those situations in front of his peers, and he’s always been out in front.”"
    },
    {
      "type": "text",
      "value": "Schlageter added that while Coogan understood his role on the team as a leader, he never let his position get to his head. Instead, he led by example, opting for a team-centric approach. The team responded well to this mentality, Schlageter said, and it boosted the Light Blue’s success. During Coogan’s junior season, the Lions’ offensive line gave up just 19 sacks for a total of 126 yards, good for the second-lowest opponent totals in Columbia history."
    },
    {
      "type": "image",
      "value": {
        "width": "",
        "asset": "https://cloudfront-us-east-1.images.arcpublishing.com/spectator/BF5CKHJTGVA7BP6JSUOPBEFXFA.JPG",
        "caption": "",
        "credit": "Image courtesy of Columbia Athletics"
      }
    },
    {
      "type": "text",
      "value": "Rising senior Ty Lenhart said Coogan was also an encouraging presence for newcomers, making a point to chat with underclassmen and make them feel special."
    },
    {
      "type": "text",
      "value": "“He was just always happy, always positive, even when he was going through stuff … always just shining light in other people’s lives, which was super special,” Lenhart said. “You don’t see that.”"
    },
    {
      "type": "text",
      "value": "According to Fischer, Coogan would consistently “go out of his way to make people feel comfortable and like they matter.” Schlageter said this uncanny ability to make others feel welcome, no matter their position, was “unlike anything I’ve ever experienced in a person.”  Younger teammates, videographers on the sidelines, and store owners in Morningside Heights were all recipients of this compassion."
    },
    {
      "type": "text",
      "value": "“I always remember that if I came in alone to Hamilton Deli, Milano’s, the barbershop on Broadway, or Bon French Laundry, they’d always ask, ‘Where’s Parker today?’” Fischer said. “I think that’s a good representation of how much of an impact he could make on total strangers.”"
    },
    {
      "type": "text",
      "value": "Coogan was not just kind and strong—he was tough, too. After tearing his PCL, a ligament in the knee that is attached to the tibia, Coogan played through discomfort for much of his senior season. That year, McLaughlin said he should have been one of the most dominant linemen in the league. Even with the injury, Coogan was awarded honorable mention and garnered a Third-Team All-Ivy League selection from Phil Steele Magazine. In the last game of the season, though, Coogan tore his ACL."
    },
    {
      "type": "text",
      "value": "An ACL tear is not a playable injury. Often, players who suffer one cannot walk off the field unaided. Coogan played fifteen more snaps."
    },
    {
      "type": "text",
      "value": "“He just loved to compete,” Neils said. During lifting sessions, strength coaches would often have to remind Coogan that there was no need to go any heavier on the weights. That competitive streak wasn’t limited to just the weight room, though, or even to the field."
    },
    {
      "type": "text",
      "value": "“He was going to beat you in Guitar Hero,” Neils said."
    },
    {
      "type": "image",
      "value": {
        "width": "",
        "asset": "https://cloudfront-us-east-1.images.arcpublishing.com/spectator/A7BLOL26PNAR5PRBS5EC3SBADA.JPG",
        "caption": "",
        "credit": "Image courtesy of Columbia Athletics"
      }
    },
    {
      "type": "text",
      "value": "In addition to his ambition on the field and in the weight room, Coogan made good use of the New York City food scene. Fischer recalled “massive Uber Eats orders,” which often led to digs from Coogan’s father when he came to town. After an apology from Parker, everyone would end up laughing, Fischer said. According to Neils, meals provided both a chance for Coogan and his friends to bond and to experience the city together."
    },
    {
      "type": "text",
      "value": "While enjoying his college years, Coogan also often thought about the future. He was a dean’s list student who participated in multiple internships during his tenure as a Lion, and he even had the opportunity to interview for a full-time position at Barclays during the fall of his senior year. The interview fell on a Friday—the day before the Columbia-Harvard game."
    },
    {
      "type": "text",
      "value": "Though he missed walkthroughs, Coogan made it back in time for the team dinner. He then received a phone call offering him the job during the meal. The following day, the Lions beat Harvard 17-10 in overtime. It was Columbia’s first win against the Crimson since 2003."
    },
    {
      "type": "text",
      "value": "“No one’s had a better 24 hours,” McLaughlin said with a chuckle. Even so, “that’s the tip of the iceberg of Parker.”"
    },
    {
      "type": "text",
      "value": "Coogan’s care extended beyond the field and onto the people around him. According to Neils, Coogan was not focused on how the world would affect him but rather, the type of impact he could have on the world."
    },
    {
      "type": "text",
      "value": "“It was a given that he was going to continue to do great things. In a short time he had such an impact on the people around him,” Neils said."
    },
    {
      "type": "text",
      "value": "<i>Sports editor Mackenzie George can be contacted at </i><a href=\"mailto:mackenzie.george@columbiaspectator.com\"><i>mackenzie.george@columbiaspectator.com</i></a><i>. Follow her on Twitter </i><a href=\"https://twitter.com/kenziegeorge22?lang=en\"><i>@kenziegeorge22</i></a>."
    },
    {
      "type": "text",
      "value": "<i>Want to keep up with breaking news? Subscribe to our </i><a href=\"https://columbiaspectator.us4.list-manage.com/subscribe?u=a3d2eeb1ae5560ca04f82f042&id=e51c51d62d\"><i>email newsletter </i></a><i>and like Spectator on </i><a href=\"https://www.facebook.com/columbiaspectator\"><i>Facebook</i></a>."
    }
  ]
}